//--------------------------------------------------------------------------------------
//  シーンクラス   ( scene.cpp )
//
//  Author : SHUN YAMASHITA
//--------------------------------------------------------------------------------------

//--------------------------------------------------------------------------------------
//  ヘッダーファイル
//--------------------------------------------------------------------------------------
#include "scene.h"
#include "effekseerManager.h"

//--------------------------------------------------------------------------------------
//  インスタンス生成
//--------------------------------------------------------------------------------------
Sence*	Sence::m_pTop[ MAX_PRIORITY ] = { NULL };
int		Sence::m_nNumScene;

//--------------------------------------------------------------------------------------
//  シーンのコンストラクタ
//--------------------------------------------------------------------------------------
Sence::Sence( int nPriority )
{
	//  最初の1回目の場合
	if( NULL == m_pTop[ nPriority ] )
	{
		m_pTop[ nPriority ] = this;
	}
	else
	{
		//  先頭ポインタの代入
		Sence* pScene = m_pTop[ nPriority ];

		//  終端ポインタの検索
		while( NULL != pScene->m_pNext )
		{
			//  次のポインタを代入
			pScene = pScene->m_pNext;
		}

		//  自分自身のポインタを次のポインタへ
		pScene->m_pNext = this;
	}

	//  優先順位の代入
	m_nPriority = nPriority;

	//  メンバ変数の初期化
	m_position = D3DXVECTOR3( 0.0f, 0.0f , 0.0f );
	m_color = D3DXCOLOR( 1.0f , 1.0f , 1.0f , 1.0f );
	m_objType = OBJTYPE_NONE;
	m_bDelete = false;
}

//--------------------------------------------------------------------------------------
//  シーンのデストラクタ
//--------------------------------------------------------------------------------------
Sence::~Sence( )
{

}

//--------------------------------------------------------------------------------------
//  全てのシーンの更新処理
//--------------------------------------------------------------------------------------
void Sence::UpdateAll( void )
{
	//  優先度の最大数分のループ
	for( int nCntPriority = 0; nCntPriority < MAX_NUM_PRIORITY; nCntPriority++ )
	{
		if( m_pTop[ nCntPriority ] != NULL )
		{
			//  先頭ポインタの代入
			Sence* pScene = m_pTop[ nCntPriority ];
			Sence* pSceneNext = NULL;
			Sence* pScenePrev = m_pTop[ nCntPriority ];

			//  シーンが空ではない間ループ
			while( pScene != NULL )
			{
				//  シーンの更新
				pScene->Update( );

				//  次のポインタを代入
				pScene = pScene->m_pNext;
			}
		}
	}
}

//--------------------------------------------------------------------------------------
//  全てのシーンの更新処理
//--------------------------------------------------------------------------------------
void Sence::UpdateAllDelete( void )
{
	//  優先度の最大数分のループ
	for( int nCntPriority = 0; nCntPriority < MAX_NUM_PRIORITY; nCntPriority++ )
	{
		if( m_pTop[ nCntPriority ] != NULL )
		{
			//  先頭ポインタの代入
			Sence* pScene = m_pTop[ nCntPriority ];
			Sence* pSceneNext = NULL;
			Sence* pScenePrev = m_pTop[ nCntPriority ];

			//  シーンが空ではない場合ループ
			while( pScene != NULL )
			{
				pSceneNext = pScene->m_pNext;

				//  削除フラグが立っている場合
				if( pScene->m_bDelete == true )
				{
					//  先頭アドレスと等しい場合
					if( pScene == m_pTop[ nCntPriority ] )
					{
						m_pTop[ nCntPriority ] = pScene->m_pNext;
					}
					else
					{
						pScenePrev->m_pNext = pScene->m_pNext;
					}

					//  シーンの終了処理
					pScene->Uninit( );
					delete pScene;
				}
				else
				{
					//  現在のシーンを前回のシーンに代入
					pScenePrev = pScene;
				}

				//  次のシーンを現在のシーンに代入
				pScene = pSceneNext;
			}
		}
	}
}

//--------------------------------------------------------------------------------------
//  全てのシーンの描画処理
//--------------------------------------------------------------------------------------
void Sence::DrawAll( void )
{
	//  優先度の最大数分のループ
	for( int nCntPriority = 0; nCntPriority < MAX_NUM_PRIORITY; nCntPriority++ )
	{
		if( m_pTop[ nCntPriority ] != NULL )
		{
			//  先頭ポインタの代入
			Sence* pScene = m_pTop[ nCntPriority ];

			//  シーンが空ではない間ループ
			while( pScene != NULL )
			{
				//  シーンの描画
				pScene->Draw( );

				//  次のポインタを代入
				pScene = pScene->m_pNext;
			}
		}

		if( nCntPriority == MAX_NUM_PRIORITY - 2 )
		{
			EffekseerManager::Draw( );
		}
	}
}

//--------------------------------------------------------------------------------------
//  全てのシーンの解放処理
//--------------------------------------------------------------------------------------
void Sence::ReleaseAll( void )
{
	//  優先度の最大数分のループ
	for( int nCntPriority = 0; nCntPriority < MAX_NUM_PRIORITY; nCntPriority++ )
	{
		if( m_pTop[ nCntPriority ] != NULL )
		{
			//  先頭ポインタの代入
			Sence* pScene = m_pTop[ nCntPriority ];
			Sence* pNextScene = pScene->m_pNext;

			while( pScene != NULL )
			{
				pNextScene = pScene->m_pNext;
				pScene->Uninit( );
				delete pScene;
				pScene = pNextScene;
			}

			//  先頭アドレスの初期化
			m_pTop[ nCntPriority ] = NULL;
		}
	}
}

//--------------------------------------------------------------------------------------
//  シーンの解放処理
//--------------------------------------------------------------------------------------
void Sence::Release( void )
{
	m_bDelete = true;
}

//--------------------------------------------------------------------------------------
//  シーン情報の次のアドレスの取得
//--------------------------------------------------------------------------------------
Sence* Sence::GetNextScene( Sence* pScene )
{
	return pScene->m_pNext;
}

//--------------------------------------------------------------------------------------
//  シーン情報先頭アドレスの取得
//--------------------------------------------------------------------------------------
Sence* Sence::GetScene( int nCntPriority )
{
	return m_pTop[ nCntPriority ];
}

//--------------------------------------------------------------------------------------
//  シーンの種類の設定
//--------------------------------------------------------------------------------------
void Sence::SetObjType( OBJTYPE objType )
{
	m_objType = objType;
}

//--------------------------------------------------------------------------------------
//  シーンの種類の取得
//--------------------------------------------------------------------------------------
Sence::OBJTYPE Sence::GetObjType( void )
{
	return m_objType;
}

//--------------------------------------------------------------------------------------
//  シーンの座標設定
//--------------------------------------------------------------------------------------
void Sence::SetPos( D3DXVECTOR3 position )
{
	m_position = position;
}

//--------------------------------------------------------------------------------------
//  シーンの座標を移動させる関数
//--------------------------------------------------------------------------------------
void Sence::MovePos( D3DXVECTOR3 velocity )
{
	m_position += velocity;
}

//--------------------------------------------------------------------------------------
//  シーンの座標を取得する関数
//--------------------------------------------------------------------------------------
D3DXVECTOR3 Sence::GetPos( void )
{
	return m_position;
}

//--------------------------------------------------------------------------------------
//  ポリゴンの大きさ設定
//--------------------------------------------------------------------------------------
void Sence::SetSize( D3DXVECTOR3 size )
{
	m_size = size;
}

//--------------------------------------------------------------------------------------
//  ポリゴンの大きさを取得する関数
//--------------------------------------------------------------------------------------
D3DXVECTOR3 Sence::GetSize( void )
{
	return m_size;
}

//--------------------------------------------------------------------------------------
//  色を設定する関数
//--------------------------------------------------------------------------------------
void Sence::SetColor( D3DXCOLOR color )
{
	m_color = color;
}